; domain
(define (domain industrial_manufacturing)
    (:requirements :strips :typing)
    (:types 
        location box content agent workstation content-type carrier place - object
    )

    (:predicates
        (connected ?loc1 ?loc2 - location)
        (box-at-loc ?box - box ?loc - location)
        (agent-at-loc ?agent - agent ?loc - location)
        (ws-at-loc ?ws - workstation ?loc - location)
        (content-at-loc ?content - content ?loc - location)
        (is-type ?content - content ?t - content-type)
        (empty-box ?box - box)
        (filled-box ?box - box ?content - content)
        (box-at-ws ?box - box ?ws - workstation)
        (box-at-place ?box - box ?place - place)
        (content-type-at-ws ?t - content-type ?ws - workstation)
        (empty-place ?place - place)
        (place-at-carrier ?place - place ?carrier - carrier)
        (carrier-at-agent ?carrier - carrier ?agent - agent)
    )

    (:action pick-up
        :parameters (?loc - location ?box - box ?agent - agent ?carrier - carrier ?place - place)
        :precondition (and
            (agent-at-loc ?agent ?loc)
            (box-at-loc ?box ?loc)
            (carrier-at-agent ?carrier ?agent)
            (place-at-carrier ?place ?carrier)
            (empty-place ?place)
        )
        :effect (and
            (box-at-place ?box ?place)
            (not (empty-place ?place))
            (not (box-at-loc ?box ?loc))
        )
    )

    (:action move
        :parameters (?from ?to - location ?agent - agent)
        :precondition (and
            (connected ?from ?to)
            (agent-at-loc ?agent ?from)
        )
        :effect (and
            (not (agent-at-loc ?agent ?from))
            (agent-at-loc ?agent ?to)
        )
    )

    (:action deliver 
        :parameters ( 
            ?box - box  
            ?ws - workstation  
            ?location - location  
            ?agent - agent  
            ?carrier - carrier  
            ?place - place 
        ) 
        :precondition (and 
            (ws-at-loc ?ws ?location) 
            (agent-at-loc ?agent ?location) 
            (carrier-at-agent ?carrier ?agent) 
            (place-at-carrier ?place ?carrier) 
            (box-at-place ?box ?place) 
        ) 
        :effect (and 
            (not (box-at-place ?box ?place)) 
            (empty-place ?place) 
            (box-at-ws ?box ?ws) 
        ) 
    ) 

    (:action fill 
        :parameters ( 
            ?box - box  
            ?content - content 
            ?loc - location  
            ?agent - agent  
            ?carrier - carrier  
            ?place - place 
        ) 
        :precondition (and 
            (content-at-loc ?content ?loc) 
            (agent-at-loc ?agent ?loc) 
            (carrier-at-agent ?carrier ?agent) 
            (place-at-carrier ?place ?carrier) 
            (box-at-place ?box ?place) 
            (empty-box ?box) 
        ) 
        :effect (and 
            (not (empty-box ?box)) 
            (filled-box ?box ?content) 
            (not (content-at-loc ?content ?loc)) 
        ) 
    ) 

    (:action empty
        :parameters (?box - box ?content - content ?t - content-type ?ws - workstation ?agent - agent ?loc - location)
        :precondition (and
            (is-type ?content ?t)
            (box-at-ws ?box ?ws)
            (ws-at-loc ?ws ?loc)
            (filled-box ?box ?content)
            (agent-at-loc ?agent ?loc)
        )
        :effect (and
            (not (filled-box ?box ?content))
            (empty-box ?box)
            (box-at-loc ?box ?loc)
            (not (box-at-ws ?box ?ws))
            (content-type-at-ws ?t ?ws)
        )
    )
)

; problem
(define (problem instance1) (:domain industrial_manufacturing)  
  (:objects  
    ; define the world 
    central_warehouse loc1 loc2 - location  
    ws1 ws2 ws3 ws4 ws5 - workstation  
    b1 b2 - box  
    a1 - agent  
    c1 - carrier 
    p1 - place 
    valve1 valve2 bolt1 bolt2 hammer1 hammer2 - content  
    valve bolt hammer - content-type  
  )  
  (:init  
    ; define the type of content 
    (is-type valve1 valve)  
    (is-type valve2 valve)  
    (is-type bolt1 bolt)  
    (is-type bolt2 bolt)  
    (is-type hammer1 hammer)  
    (is-type hammer2 hammer)  
 
    ; define the empty box located at central_warehouse 
    (box-at-loc b1 central_warehouse)  
    (box-at-loc b2 central_warehouse)  
    (empty-box b1)  
    (empty-box b2)  
             
    ; define content located at central_warehouse 
    (content-at-loc valve1 central_warehouse)  
    (content-at-loc valve2 central_warehouse)  
    (content-at-loc bolt1 central_warehouse)  
    (content-at-loc bolt2 central_warehouse)  
    (content-at-loc hammer1 central_warehouse)  
    (content-at-loc hammer2 central_warehouse)  
 
    ; define workstation located at central_warehouse 
    (ws-at-loc ws1 loc1)  
    (ws-at-loc ws2 loc1)  
    (ws-at-loc ws3 loc2)  
    (ws-at-loc ws4 loc2)  
    (ws-at-loc ws5 loc2) 
 
    ; define workstation located at central_warehouse 
    (connected central_warehouse loc1)  
    (connected central_warehouse loc2)  
    (connected loc1 central_warehouse)  
    (connected loc2 central_warehouse)  
 
    ; define agent located initially located at central_warehouse 
    (agent-at-loc a1 central_warehouse)  
    (carrier-at-agent c1 a1) 
    (place-at-carrier p1 c1) 
    (empty-place p1) 
  )  
  (:goal  
    ; define goals to satisfied  
    (and  
      (content-type-at-ws bolt ws1)  
      (content-type-at-ws valve ws1)  
      (content-type-at-ws bolt ws2)  
      (content-type-at-ws hammer ws3)  
      (content-type-at-ws valve ws3)  
      (content-type-at-ws hammer ws4)  
    )  
   )  
  )

; plan
1. (pick-up central_warehouse b2 a1 c1 p1)
   deleted: (empty-place p1) (box-at-loc b2 central_warehouse)
   added: (box-at-place b2 p1)
   goals met: 0 of 6
2. (fill b2 bolt1 central_warehouse a1 c1 p1)
   deleted: (empty-box b2) (content-at-loc bolt1 central_warehouse)
   added: (filled-box b2 bolt1)
   goals met: 0 of 6
3. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 0 of 6
4. (deliver b2 ws2 loc1 a1 c1 p1)
   deleted: (box-at-place b2 p1)
   added: (empty-place p1) (box-at-ws b2 ws2)
   goals met: 0 of 6
5. (empty b2 bolt1 bolt ws2 a1 loc1)
   deleted: (filled-box b2 bolt1) (box-at-ws b2 ws2)
   added: (empty-box b2) (box-at-loc b2 loc1) (content-type-at-ws bolt ws2)
   goals met: 1 of 6
6. (pick-up loc1 b2 a1 c1 p1)
   deleted: (empty-place p1) (box-at-loc b2 loc1)
   added: (box-at-place b2 p1)
   goals met: 1 of 6
7. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 1 of 6
8. (fill b2 bolt2 central_warehouse a1 c1 p1)
   deleted: (empty-box b2) (content-at-loc bolt2 central_warehouse)
   added: (filled-box b2 bolt2)
   goals met: 1 of 6
9. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 1 of 6
10. (deliver b2 ws1 loc1 a1 c1 p1)
   deleted: (box-at-place b2 p1)
   added: (empty-place p1) (box-at-ws b2 ws1)
   goals met: 1 of 6
11. (empty b2 bolt2 bolt ws1 a1 loc1)
   deleted: (filled-box b2 bolt2) (box-at-ws b2 ws1)
   added: (empty-box b2) (box-at-loc b2 loc1) (content-type-at-ws bolt ws1)
   goals met: 2 of 6
12. (pick-up loc1 b2 a1 c1 p1)
   deleted: (empty-place p1) (box-at-loc b2 loc1)
   added: (box-at-place b2 p1)
   goals met: 2 of 6
13. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 2 of 6
14. (fill b2 valve1 central_warehouse a1 c1 p1)
   deleted: (empty-box b2) (content-at-loc valve1 central_warehouse)
   added: (filled-box b2 valve1)
   goals met: 2 of 6
15. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 2 of 6
16. (deliver b2 ws1 loc1 a1 c1 p1)
   deleted: (box-at-place b2 p1)
   added: (empty-place p1) (box-at-ws b2 ws1)
   goals met: 2 of 6
17. (empty b2 valve1 valve ws1 a1 loc1)
   deleted: (filled-box b2 valve1) (box-at-ws b2 ws1)
   added: (empty-box b2) (box-at-loc b2 loc1) (content-type-at-ws valve ws1)
   goals met: 3 of 6
18. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 3 of 6
19. (pick-up central_warehouse b1 a1 c1 p1)
   deleted: (empty-place p1) (box-at-loc b1 central_warehouse)
   added: (box-at-place b1 p1)
   goals met: 3 of 6
20. (fill b1 valve2 central_warehouse a1 c1 p1)
   deleted: (empty-box b1) (content-at-loc valve2 central_warehouse)
   added: (filled-box b1 valve2)
   goals met: 3 of 6
21. (move central_warehouse loc2 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc2)
   goals met: 3 of 6
22. (deliver b1 ws3 loc2 a1 c1 p1)
   deleted: (box-at-place b1 p1)
   added: (empty-place p1) (box-at-ws b1 ws3)
   goals met: 3 of 6
23. (empty b1 valve2 valve ws3 a1 loc2)
   deleted: (filled-box b1 valve2) (box-at-ws b1 ws3)
   added: (empty-box b1) (box-at-loc b1 loc2) (content-type-at-ws valve ws3)
   goals met: 4 of 6
24. (pick-up loc2 b1 a1 c1 p1)
   deleted: (empty-place p1) (box-at-loc b1 loc2)
   added: (box-at-place b1 p1)
   goals met: 4 of 6
25. (move loc2 central_warehouse a1)
   deleted: (agent-at-loc a1 loc2)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 4 of 6
26. (fill b1 hammer1 central_warehouse a1 c1 p1)
   deleted: (empty-box b1) (content-at-loc hammer1 central_warehouse)
   added: (filled-box b1 hammer1)
   goals met: 4 of 6
27. (move central_warehouse loc2 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc2)
   goals met: 4 of 6
28. (deliver b1 ws3 loc2 a1 c1 p1)
   deleted: (box-at-place b1 p1)
   added: (empty-place p1) (box-at-ws b1 ws3)
   goals met: 4 of 6
29. (empty b1 hammer1 hammer ws3 a1 loc2)
   deleted: (filled-box b1 hammer1) (box-at-ws b1 ws3)
   added: (empty-box b1) (box-at-loc b1 loc2) (content-type-at-ws hammer ws3)
   goals met: 5 of 6
30. (pick-up loc2 b1 a1 c1 p1)
   deleted: (empty-place p1) (box-at-loc b1 loc2)
   added: (box-at-place b1 p1)
   goals met: 5 of 6
31. (move loc2 central_warehouse a1)
   deleted: (agent-at-loc a1 loc2)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 5 of 6
32. (fill b1 hammer2 central_warehouse a1 c1 p1)
   deleted: (empty-box b1) (content-at-loc hammer2 central_warehouse)
   added: (filled-box b1 hammer2)
   goals met: 5 of 6
33. (move central_warehouse loc2 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc2)
   goals met: 5 of 6
34. (deliver b1 ws4 loc2 a1 c1 p1)
   deleted: (box-at-place b1 p1)
   added: (empty-place p1) (box-at-ws b1 ws4)
   goals met: 5 of 6
35. (empty b1 hammer2 hammer ws4 a1 loc2)
   deleted: (filled-box b1 hammer2) (box-at-ws b1 ws4)
   added: (empty-box b1) (box-at-loc b1 loc2) (content-type-at-ws hammer ws4)
   goals met: 6 of 6
